_posts/2016-09-01-problems.html
---
layout: page
title: Problems
date: 2016-09-01
category: trouble
permalink: trouble/problems
---


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Problems with LaTeX</h2>
<div class="outline-text-2" id="text-1">
<p>
If you would like to reproduce the figures but don't have a LaTeX distribution available, just comment-out the code block below in the Python scripts that plot figures:<br  />
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">from</span> matplotlib <span style="color: #859900;">import</span> rc

rc(<span style="color: #2aa198;">'text'</span>, usetex=<span style="color: #6c71c4;">True</span>)
<span style="color: #b58900;">pl.rcParams</span>[<span style="color: #2aa198;">'text.latex.preamble'</span>] = [
    r<span style="color: #2aa198;">'\usepackage{tgheros}'</span>,    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #657b83; font-style: italic;">helvetica font</span>
    r<span style="color: #2aa198;">'\usepackage{sansmath}'</span>,   <span style="color: #586e75; font-style: italic;"># </span><span style="color: #657b83; font-style: italic;">math-font matching helvetica</span>
    r<span style="color: #2aa198;">'\sansmath'</span>                <span style="color: #586e75; font-style: italic;"># </span><span style="color: #657b83; font-style: italic;">actually tell tex to use it!</span>
    r<span style="color: #2aa198;">'\usepackage{siunitx}'</span>,    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #657b83; font-style: italic;">micro symbols</span>
    r<span style="color: #2aa198;">'\sisetup{detect-all}'</span>,    <span style="color: #586e75; font-style: italic;"># </span><span style="color: #657b83; font-style: italic;">force siunitx to use the fonts</span>
]
</pre>
</div>
</div>
</div>
